a=[1.0375	1.097222222 0.992647059 1.136054422	1.071428571	0.159874608	1.063829787	1.232758621	1.164383562	1.240875912];
b=[249.95	262.64	157.38	249.1	145.71	151.52	146.73	155.16	236.63	254.66];
x=1:10;
[Ax,H1,H2]=plotyy(x,a,x,b);
set(get(Ax(1),'Ylabel'),'String','长轴/短轴') %左侧y轴
set(get(Ax(2),'Ylabel'),'String','重量（g）') %右侧y轴
%xlabel('Time (\musec)')
%title('Multiple Decay Rates')
set(H1,'Color','b','marker','.','MarkerFaceColor','b')%对应第一条曲线的线性y1
set(H2,'Color','r','marker','*','MarkerFaceColor','b')%对应第一条曲线的线性y2
hLegend = legend([H1,H2],'长轴/短轴','重量');
set(Ax(1),'fontsize',15,'fontname','Times')
set(Ax(2),'fontsize',15,'fontname','Times')


%the 2nd fig
c1=[1 1 1 1 1 1 1 1 1 1];
d1=[0.648305806	0.744661096	0.822299652	0.731483905	0.692895605	0.75080171	0.617696582	0.720520943	0.830390335	0.716395864];
c2=[2	2	2	2	2	2	2	2	2	2];
d2=[0.674150783	0.656220848	0.83734072	0.757099227	0.562355342	0.63718158	0.664576803	0.784565916	0.70341751	0.757082717];
c3=[3	3	3	3	3	3	3	3	3	3];
d3=[0.832450832	0.850220264	0.816283925	0.777565328	0.689467312	0.757919135	0.803008799	0.807179487	0.758664955	0.848884381];
c4=[4	4	4	4	4	4	4	4	4	4];
d4=[0.733243968	0.839867659	0.862998102	0.862998102	0.736573759	0.872432246	0.839668616	0.842680047	0.842680047	0.815033784];
c=[c1 c2 c3 c4];
d=[d1 d2 d3 d4];
figure;
stem(c1,d1);
hold on
stem(c2,d2);
stem(c3,d3);
stem(c4,d4);
hold off
%stem(c1,d1,c2,d2,c3,d3,c4,d4);
axis([0.5 4.5 0.5 0.9])
%legend('近果皮处','果核处','果梗处','果实中部'); 
set(gca, 'XTick', [1 2 3 4]) %设置X坐标轴刻度数据点位置
set(gca,'xticklabel',{'近果皮处','果核处','果梗处','果实中部'})
axis square

%the 3rd fig
c1=[1 1 1 1 1 1 1 1 1 1];
d1=[3.257872022	5.506544783	4.968796504	5.461913151	5.8683261	6.370502821	8.24883893	7.090487842	5.93758546	5.820002733];
c2=[2	2	2	2	2	2	2	2	2	2];
d2=[4.140873545	4.502385182	3.925120773	7.369061549	4.568866445	4.86314886	4.879432257	4.549248718	5.317336211	4.982420708];
c3=[3	3	3	3	3	3	3	3	3	3];
d3=[4.09934089	7.675998153	3.268325924	5.068961881	4.917924829	4.79704362	6.51409362	4.958814096	4.156369516	4.250897155];
c4=[4	4	4	4	4	4	4	4	4	4];
d4=[3.257354964	2.289720514	4.484726696	5.427108752	8.021412171	4.725673862	3.48271274	3.490955534	4.664595372	4.639801822];
c=[c1 c2 c3 c4];
d=[d1 d2 d3 d4];
figure;
stem(c1,d1);
hold on
stem(c2,d2);
stem(c3,d3);
stem(c4,d4);
hold off
%stem(c1,d1,c2,d2,c3,d3,c4,d4);
axis([0.5 4.5 2 9])
%legend('近果皮处','果核处','果梗处','果实中部'); 
set(gca, 'XTick', [1 2 3 4]) %设置X坐标轴刻度数据点位置
set(gca,'xticklabel',{'近果皮处','果核处','果梗处','果实中部'})
axis square

%the fig 4
a=[11	7.75	10.3	11.25	12.6	11.75	11.85	11.5	12.75	10.15];
b=[0.35	0.34	0.34	0.34	0.34	0.41	0.42	0.37	0.34	0.335];
x=1:10;
[Ax,H1,H2]=plotyy(x,a,x,b);
set(get(Ax(1),'Ylabel'),'String','TSS(%)') %左侧y轴
set(get(Ax(2),'Ylabel'),'String','电导率（x10^{5}μs/cm)') %右侧y轴
%xlabel('Time (\musec)')
%title('Multiple Decay Rates')
set(H1,'Color','b','marker','.','MarkerFaceColor','b')%对应第一条曲线的线性y1
set(H2,'Color','r','marker','*','MarkerFaceColor','b')%对应第一条曲线的线性y2
hLegend = legend([H1,H2],'TSS','电导率');
set(Ax(1),'Ytick',[5:1:15]);
set(Ax(2),'Ytick',[0.3:0.05:0.5]);
set(Ax(1),'fontsize',15,'fontname','Times')
set(Ax(2),'fontsize',15,'fontname','Times')

